const { ButtonStyle } = require('discord.js')
module.exports = {
  token:
    "MTM4MTYzNTcyMTYwNDg5MDY5NQ.GCJTtG.PIRYiLp3v77FMge3J72rw4-RF18WcjhbXHQoK0", // โทเคนบอท

  roleAdmin: "1292853582877556747", //ยศแอดมิน
  guild: ["1277228986266681407"], //เซิฟเวอร์
  WhitelistRole: "1292900921721884725", //ยศไวริส
  channelId: "1381629375253839922", //ห้องสำหรับกดรับ
  channelId_Log: "1381634674773725285", // ห้องสำหรับข้อมูล
  // setting ส่วนแรกคือหน้ากด
  main: {
    button_msg: "กดปุ่มเพื่อกรอกข้อมูล", // ข้อความปุ่ม
    button_emoji: "✅", // อิโมจิเท่านั้น สามารถใช้อิโมจิพิเศษได้ ตัวอย่าง `<a:964520638406623232:1258823539210063873>`
    button_style: ButtonStyle.Success, //จำเป็นต้องมี ButtonStyle อยุ่ข้างหน้าเสมอ มีทั้งหมด 4สี ได้แก่ Primary สีน้ำเงิน , Secondary = เทา , Success = เขียว ,Danger =แดง 
    title: "บอทกรอกข้อมูล", // ชื่อหัวข้อ
    iconURL: "", // รูปไอคอน
    Description: "**แบบฟอร์มกรอบข้อมูล** \n\n" +"📋 **กรุณาอ่านกฎก่อนดำเนินการกรอกข้อมูล** \n" +"```" +"🔥 ข้อมูลที่กรอกต้องถูกต้องและครบถ้วน 🔥\n" +"⚠️ หากพบการละเมิดกฎ จะมีการดำเนินการตามที่กำหนด ⚠️" +"```", // คำอธิบาย


    colors: "#ff0003", // #a7e7ff -> [R, G, B] // 12942973
    image: "", // รูปหลัก
  },
  //ชื่อของหัวข้อหลังกดปุ่ม
  modals: {
    title: "บอทกรอกข้อมูล"
  },
  //setting หลังกรอกข้อมูลเสร็จ
  reply_submit: {
    title: "บอทกรอกข้อมูล", // ชื่อหัวข้อ
    iconURL: "", // รูปไอคอน
    colors: "#41ff00", // #a7e7ff -> [R, G, B] // 12942973
    Description: "**คุณได้ทำการกรอกเป็นที่เรียบร้อยแล้ว รอทาง**"
  },
  reply_admin: {
    title: "บอทกรอกข้อมูล", // ชื่อหัวข้อ
    iconURL: "", // รูปไอคอน
  }
};
